In [2]:
import pandas as pd
import numpy as np
import sqlite3

In [3]:
orders = pd.read_csv("orders.csv")

In [4]:
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [5]:
users = pd.read_json("users.json")

In [6]:
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [ ]:
import sqlite3

conn = sqlite3.connect(r"C:\Users\Hemant\Downloads\restaurants.db")
cursor = conn.cursor()

with open(r"C:\Users\Hemant\Downloads\restaurants.sql", "r", encoding="utf-8") as f:
    sql_script = f.read()

cursor.executescript(sql_script)
conn.commit()


pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type='table';",
    conn
)

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

In [17]:
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [18]:
# Merging

merged1 = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

In [19]:
merged1.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [20]:
final_df = pd.merge(
    merged1,
    restaurants,
    on="restaurant_id",
    how="left"
)

In [21]:
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [22]:
final_df.to_csv("final_food_delivery_dataset.csv",index=False)

### final data cleaning

In [24]:
df = pd.read_csv("final_food_delivery_dataset.csv")

In [25]:
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [27]:
df.isnull().sum()

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city                 0
membership           0
restaurant_name_y    0
cuisine              0
rating               0
dtype: int64

In [28]:
df['order_date'] = pd.to_datetime(df['order_date'])

C:\Users\Hemant\AppData\Local\Temp\ipykernel_45972\2765250300.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['order_date'] = pd.to_datetime(df['order_date'])

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  datetime64[ns]
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(6)
memory usage: 937.6+ KB

### 1>. Order trends over time

In [31]:
month_order = df.groupby(df['order_date'].dt.month).size()

In [32]:
month_order

order_date
1     831
2     785
3     903
4     812
5     844
6     784
7     859
8     851
9     812
10    863
11    807
12    849
dtype: int64

In [33]:
df.head(3)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0

### 2>. User behavior patterns

In [34]:
user_order = df.groupby('user_id').size().sort_values(ascending=False)

In [35]:
user_order

user_id
2973    13
1515    12
496     11
874     11
1337    11
        ..
2961     1
2957     1
2951     1
1276     1
1272     1
Length: 2883, dtype: int64

In [36]:
df.head(2)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5

### 3>. City-wise and cuisine-wise performance

In [39]:
city_performance = df.groupby('city').size().sort_values(ascending=False)

In [40]:
city_performance

city
Bangalore    2751
Chennai      2469
Pune         2430
Hyderabad    2350
dtype: int64

In [41]:
cuisine_performance = df.groupby('cuisine').size().sort_values(ascending=False)

In [42]:
cuisine_performance

cuisine
Mexican    2581
Italian    2532
Indian     2469
Chinese    2418
dtype: int64

In [43]:
df.head(2)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5

In [44]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

### 4>. Membership impact (Gold vs Regular)

In [45]:
membership_revenue = df.groupby('membership')['total_amount'].sum()

In [46]:
membership_revenue

membership
Gold       3975364.89
Regular    4036259.23
Name: total_amount, dtype: float64

### 5>. Revenue distribution and seasonality

In [47]:
month_revenue = df.groupby(df['order_date'].dt.month)['total_amount'].sum()

In [48]:
month_revenue

order_date
1     663020.26
2     630867.40
3     716738.98
4     666097.18
5     668428.61
6     610822.93
7     688559.45
8     694987.58
9     653838.07
10    699187.73
11    637772.43
12    681303.50
Name: total_amount, dtype: float64

In [49]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

## 1>. Find the city which has the highst total revenue from gold membres

In [60]:


gold_user = df[df['membership']=='Gold']

In [61]:
gold_user.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
8,9,364,7,2023-12-05,953.30,Ruchi Biryani Punjabi,User_364,Chennai,Gold,Restaurant_7,Italian,3.2
11,12,884,423,2023-10-27,1484.65,Royal Tiffins Multicuisine,User_884,Pune,Gold,Restaurant_423,Indian,3.2
13,14,364,112,2023-09-24,898.24,Grand Cafe Punjabi,User_364,Chennai,Gold,Restaurant_112,Chinese,3.2

In [74]:
city_revenue = gold_user.groupby('city')['total_amount'].sum().sort_values(ascending=False)

In [75]:
city_revenue

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [76]:
top_city = city_revenue.head(1)
top_city

city
Chennai    1080909.79
Name: total_amount, dtype: float64

In [67]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

## 2>. Which cuisine has the highest average order value across all orders

In [72]:
avg_cuisine = df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False)

In [73]:
avg_cuisine

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [77]:
top_cuisine = avg_cuisine.head(1)

In [78]:
top_cuisine

cuisine
Mexican    808.021344
Name: total_amount, dtype: float64

### 3>.How many distinct user placed orders worth more than 1000 in total(sum of all their orders)

In [80]:
user_total_amount = df.groupby('user_id')['total_amount'].sum()
user_total_amount

user_id
1       1289.66
2       7564.12
3       1839.51
4       3741.16
5       5742.88
         ...
2996    1533.54
2997    5310.32
2998    4241.47
2999     643.89
3000    2226.63
Name: total_amount, Length: 2883, dtype: float64

In [82]:
user_above_1000 = user_total_amount[user_total_amount > 1000]
user_above_1000

user_id
1       1289.66
2       7564.12
3       1839.51
4       3741.16
5       5742.88
         ...
2995    2472.66
2996    1533.54
2997    5310.32
2998    4241.47
3000    2226.63
Name: total_amount, Length: 2544, dtype: float64

In [84]:
count_user = user_above_1000.count()
print(count_user)

2544

In [85]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

## 4>. Which restaurants rating range generated the highest total revenue

In [86]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0-3.5', '3.6-4.0', '4.1-4.5', '4.6-5.0']

df['rating_range'] = pd.cut(df['rating'], bins=bins, labels=labels, include_lowest=True)

In [87]:
rating_revenue = df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)
rating_revenue

C:\Users\Hemant\AppData\Local\Temp\ipykernel_45972\956634300.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  rating_revenue = df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)

rating_range
4.6-5.0    2197030.75
3.0-3.5    2136772.70
4.1-4.5    1960326.26
3.6-4.0    1717494.41
Name: total_amount, dtype: float64

In [89]:
top_rating_range = rating_revenue.head(1)
top_rating_range

rating_range
4.6-5.0    2197030.75
Name: total_amount, dtype: float64

## 5>. Among gold memebers which city has the highest average order value

In [91]:
city_avg_order = gold_user.groupby('city')['total_amount'].mean().sort_values(ascending=False)
city_avg_order

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [92]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating', 'rating_range'],
      dtype='object')

## 6>. Which cuisine has the lowest no. of distinct restaurants but still contributes significant revenue

In [93]:
cuisine_stat = df.groupby('cuisine').agg(restaurant_count=('restaurant_id', 'nunique'), total_revenue =('total_amount', 'sum'))
cuisine_stat

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65
Indian                126     1971412.58
Italian               126     2024203.80
Mexican               128     2085503.09

In [94]:
sort_cuisine = cuisine_stat.sort_values(by=['restaurant_count','total_revenue'], ascending=[True,False])
sort_cuisine

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65
Italian               126     2024203.80
Indian                126     1971412.58
Mexican               128     2085503.09

## 7>. What percentage of gold order were placed by gold members(rounded by nearest integer)

In [95]:
total_order = df.shape[0]
total_order

10000

In [96]:
gold_orders = gold_user.shape[0]
gold_orders

4987

In [98]:
per_gold = (gold_orders / total_order)*100
per_gold

49.87

In [99]:
round_per = round(per_gold)
round_per

50

In [100]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating', 'rating_range'],
      dtype='object')

In [101]:
df.head(1)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,rating_range
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2,3.0-3.5

## 8>. Which restaurant has the highest average order value but has less than 20 total orders

In [105]:
restaurant_stat = df.groupby('restaurant_name_x').agg(total_order=('order_id', 'count'), avg_order =('total_amount', 'mean'))
restaurant_stat

                                    total_order   avg_order
restaurant_name_x
Amma Biryani Family Restaurant               45  799.941556
Amma Biryani North Indian                    57  774.900526
Amma Biryani South Indian                    15  708.708667
Amma Cafe Non-Veg                            24  736.174583
Amma Cafe North Indian                       11  667.979091
...                                         ...         ...
Udupi Mess Pure Veg                          22  768.489091
Udupi Restaurant Family Restaurant           19  796.961053
Udupi Restaurant Pure Veg                    10  895.619000
Udupi Restaurant South Indian                18  828.162778
Udupi Tiffins Punjabi                        27  914.233704

[433 rows x 2 columns]

In [106]:
filter_restaurant  = restaurant_stat[restaurant_stat['total_order'] < 20]
filter_restaurant

                                    total_order   avg_order
restaurant_name_x
Amma Biryani South Indian                    15  708.708667
Amma Cafe North Indian                       11  667.979091
Amma Cafe Pure Veg                           17  839.633529
Amma Curry House Family Restaurant           18  821.800556
Amma Delights Family Restaurant              17  761.249412
...                                         ...         ...
Udupi Mess Family Restaurant                 16  831.023125
Udupi Mess North Indian                      16  898.528125
Udupi Restaurant Family Restaurant           19  796.961053
Udupi Restaurant Pure Veg                    10  895.619000
Udupi Restaurant South Indian                18  828.162778

[170 rows x 2 columns]

In [107]:
sort_restaurant = filter_restaurant.sort_values(by='avg_order',ascending=False)
sort_restaurant

                                   total_order    avg_order
restaurant_name_x
Hotel Dhaba Multicuisine                    13  1040.222308
Sri Mess Punjabi                            12  1029.180833
Ruchi Biryani Punjabi                       16  1002.140625
Sri Delights Pure Veg                       18   989.467222
Classic Kitchen Family Restaurant           19   973.167895
...                                        ...          ...
Annapurna Tiffins Punjabi                   19   621.828947
Darbar Tiffins Non-Veg                      18   596.815556
Darbar Restaurant Punjabi                   14   589.972857
Spice Tiffins Pure Veg                      15   578.578667
Ruchi Mess Punjabi                          17   572.686471

[170 rows x 2 columns]

In [108]:
df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating', 'rating_range'],
      dtype='object')

## 9>. Which combination contributes the highest revenue

In [109]:
combo_revenue = df.groupby(['membership', 'cuisine'])['total_amount'].sum().sort_values(ascending=False)
combo_revenue

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [111]:
top_combo = combo_revenue.head(1) 
top_combo

membership  cuisine
Regular     Mexican    1072943.3
Name: total_amount, dtype: float64

## 10>. During which quarter of the year is total revenue highest

In [114]:
df['quarter'] = df['order_date'].dt.quarter
df['quarter'].value_counts()

quarter
3    2522
1    2519
4    2519
2    2440
Name: count, dtype: int64

In [115]:
quarter_revenue = df.groupby('quarter')['total_amount'].sum().sort_values(ascending=False)
quarter_revenue

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

# NUMERIC QUESTIONS

## 1> How many total orders were placed by users with gold members

In [117]:
gold_user.shape[0]

4987

## 2>

In [119]:
revenue_hy = df[df['city'] == 'Hyderabad']['total_amount'].sum()
revenue_hy

np.float64(1889366.58)

## 3>

In [122]:
distinct_user = df['user_id'].nunique()
distinct_user

2883

## 4>

In [124]:
gold_avg = round(df[df['membership'] == 'Gold']['total_amount'].mean(), 2)
gold_avg

np.float64(797.15)

## 5>

In [126]:
order_high = df[df['rating'] > 4.5].shape[0]
order_high

2772

## 6>

In [129]:
gold_df = df[df['membership'] == 'Gold']

city_revenue = gold_df.groupby('city')['total_amount'].sum()

top_city = city_revenue.idxmax()
top_city

'Chennai'

In [130]:
order_city_gold = gold_df[gold_df['city'] == top_city].shape[0]
order_city_gold

1337

In [131]:
df.shape[0]

10000